
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФИО = "ЛАВРОВ СЕРГЕЙ ВИКТОРОВИЧ";
	Паспорт = "0000000590";
КонецПроцедуры

&НаКлиенте
Процедура ServiceAuthorization(Команда)
	ServiceAuthorizationНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура PublPersons(Команда)
	ОчиститьСообщения();
	PublPersonsНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура CheckPassport(Команда)
	ОчиститьСообщения();
	CheckPassportНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура CheckPassportMVD(Команда)
	ОчиститьСообщения();
	CheckPassportMVDНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура GetInnFl(Команда)
	ОчиститьСообщения();
	GetInnFlНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ServiceExit(Команда)
	ServiceExitНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюФизЛицо(Команда)
	ЗаполнитьПоУмолчаниюФизЛицоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюСтруктуру(Команда)
	ЗаполнитьПоУмолчаниюСтруктуруНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПровестиСкринингФизЛица(Команда)
	ОчиститьСообщения();
	ПровестиСкринингФизЛицаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ServiceAuthorizationНаСервере()
	
	л_Объект		= РеквизитФормыВЗначение("Объект");
	ИДСессии		= л_Объект.ServiceAuthorization();
	
КонецПроцедуры

&НаСервере
Процедура PublPersonsНаСервере()
	
	л_Объект			= РеквизитФормыВЗначение("Объект");
	Ответ				= л_Объект.PublPersons(ИДСессии, ФИО);
	ИДСессии			= Ответ.ИДСессии;
	
	Сообщить(СтрШаблон("Это ПДЛ: %1", Ответ.ИнфоПДЛ.ЭтоПДЛ));
	
КонецПроцедуры


&НаСервере
Процедура CheckPassportНаСервере()
	
	л_Объект			= РеквизитФормыВЗначение("Объект");
	Ответ				= л_Объект.CheckPassport(ИДСессии, Паспорт);
	ИДСессии			= Ответ.ИДСессии;
	
	Сообщить(СтрШаблон("Паспорт недействителен: %1
					|Расширенный ответ: 
					|%2", Ответ.ИнфоПаспорт.ПаспортНедействителен, Ответ.ИнфоПаспорт.РасширенныйОтвет));

	
КонецПроцедуры

&НаСервере
Процедура CheckPassportMVDНаСервере()
	
	л_Объект			= РеквизитФормыВЗначение("Объект");
	Ответ				= л_Объект.CheckPassportMVD(ИДСессии, Паспорт);
	ИДСессии			= Ответ.ИДСессии;
	
	Сообщить(СтрШаблон("Паспорт недействителен: %1
						|Расширенный ответ: %2
						|Описание ошибки: %3"
						, Ответ.ИнфоПаспорт.ПаспортНедействителен
						, Ответ.ИнфоПаспорт.РасширенныйОтвет
						, Ответ.ИнфоПаспорт.ОписаниеОшибки));
	
КонецПроцедуры

&НаСервере
Процедура GetInnFlНаСервере()
	
	л_Объект			= РеквизитФормыВЗначение("Объект");
	Ответ				= л_Объект.GetInnFl(ИДСессии, Фамилия, Имя, Отчество, ДатаРождения, ТипДокумента, НомерДокумента, ДатаДокумента);
	ИДСессии			= Ответ.ИДСессии;
	
	Сообщить(СтрШаблон("Результат поиска ИНН: %1
						|ИНН: %2", Ответ.ИнфоИНН.РезультатПоиска, Ответ.ИнфоИНН.ИНН));

КонецПроцедуры

&НаСервере
Процедура ServiceExitНаСервере()
	
	л_Объект 			= РеквизитФормыВЗначение("Объект");
	л_Объект.ServiceExit(ИДСессии);
	ИДСессии 		= "";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюСтруктуруНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗапросыНаРегистрациюПакетовДокументов.Клиент КАК Клиент
		|ИЗ
		|	Справочник.ЗапросыНаРегистрациюПакетовДокументов КАК ЗапросыНаРегистрациюПакетовДокументов
		|ГДЕ
		|	НЕ ЗапросыНаРегистрациюПакетовДокументов.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗапросыНаРегистрациюПакетовДокументов.ДатаРегистрации УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФизЛицо = ВыборкаДетальныеЗаписи.Клиент;
	КонецЦикла;

	
	л_Объект						= РеквизитФормыВЗначение("Объект");	
	ДанныеФизЛицаДляПолученияИНН 	= л_Объект.ПолучитьДанныеФизЛица(ФизЛицо);
	ДанныеДокументаДляПолученияИНН 	= л_Объект.ПолучитьДанныеДокументаДляПолученияИНН(ФизЛицо);			
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеФизЛицаДляПолученияИНН, "Фамилия, Имя, Отчество, ДатаРождения, ИНН");
	НомерДокумента					= ДанныеДокументаДляПолученияИНН.Номер;
	ТипДокумента					= ДанныеДокументаДляПолученияИНН.Документ;
	ДатаДокумента					= ДанныеДокументаДляПолученияИНН.ДатаВыдачи;
	ФИО 							= СокрЛП(СтрШаблон("%1 %2 %3", Фамилия, Имя, Отчество));
	Паспорт							= НомерДокумента;
	
	ФизЛицо 						= Справочники.Контрагенты.ПустаяСсылка();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюФизЛицоНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗапросыНаРегистрациюПакетовДокументов.Клиент КАК Клиент
		|ИЗ
		|	Справочник.ЗапросыНаРегистрациюПакетовДокументов КАК ЗапросыНаРегистрациюПакетовДокументов
		|ГДЕ
		|	НЕ ЗапросыНаРегистрациюПакетовДокументов.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗапросыНаРегистрациюПакетовДокументов.ДатаРегистрации УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФизЛицо = ВыборкаДетальныеЗаписи.Клиент;
	КонецЦикла;
	
	Фамилия 		= "";
	Имя 			= "";
	Отчество		= "";
	ДатаРождения	= '00010101';
	ТипДокумента	= "";
	НомерДокумента	= "";
	ДатаДокумента	= '00010101';
	ФИО				= "";
	Паспорт			= "";
	
КонецПроцедуры

&НаСервере
Процедура ПровестиСкринингФизЛицаНаСервере()
	
	л_Объект						= РеквизитФормыВЗначение("Объект");	
	Если ЗначениеЗаполнено(ФизЛицо) Тогда 
		ПараметрФизЛицо	= ФизЛицо;
	Иначе 
		ПараметрФизЛицо = Новый Структура;
		ПараметрФизЛицо.Вставить("СерияНомерПаспорта", 				Паспорт);
		ПараметрФизЛицо.Вставить("Фамилия", 						Фамилия);
		ПараметрФизЛицо.Вставить("Имя", 							Имя);
		ПараметрФизЛицо.Вставить("Отчество", 						Отчество);
		ПараметрФизЛицо.Вставить("ДатаРождения", 					ДатаРождения);
		ПараметрФизЛицо.Вставить("ТипДокументаПолучениеИНН", 		ТипДокумента);
		ПараметрФизЛицо.Вставить("НомерДокументаПолучениеИНН", 		НомерДокумента);
		ПараметрФизЛицо.Вставить("ДатаДокументаПолучениеИНН", 		ДатаДокумента);
		ПараметрФизЛицо.Вставить("ФИО", 							ФИО);
		ПараметрФизЛицо.Вставить("ИНН", 							ИНН);		
	КонецЕсли;
	
	ПараметрыПроверки	= Новый Структура;
	ПараметрыПроверки.Вставить("ИДСессии", 							ИДСессии);
	ПараметрыПроверки.Вставить("ПроверитьПаспортПоБазеМВД", 		Истина);
	ПараметрыПроверки.Вставить("ПроверитьПаспортПоБазеМВДОнлайн", 	Истина);
	ПараметрыПроверки.Вставить("ПолученитьИННОтНалоговой", 			Истина);
	ПараметрыПроверки.Вставить("ПроверитьПринадлежностьКПДЛ", 		Истина);
	
	Результат = л_Объект.ПровестиСкринингФизЛица(ПараметрФизЛицо, ПараметрыПроверки);
	
	
	Сообщить(СтрШаблон("Результат проверки физ. лица: %1", ?(ЗначениеЗаполнено(ФизЛицо), ФизЛицо, ФИО)));
	
	Если ПараметрыПроверки.Свойство("ПроверитьПаспортПоБазеМВД")
		И ПараметрыПроверки.ПроверитьПаспортПоБазеМВД Тогда
		ИДСессии			= Результат.РезультатПроверкиПаспортаПоБазеМВД.ИДСессии;
		
		Сообщить(СтрШаблон("Паспорт недействителен: %1
						|Расширенный ответ: 
						|%2", Результат.РезультатПроверкиПаспортаПоБазеМВД.ИнфоПаспорт.ПаспортНедействителен, Результат.РезультатПроверкиПаспортаПоБазеМВД.ИнфоПаспорт.РасширенныйОтвет));
	КонецЕсли;
	
	Если ПараметрыПроверки.Свойство("ПроверитьПаспортПоБазеМВДОнлайн")
		И ПараметрыПроверки.ПроверитьПаспортПоБазеМВДОнлайн Тогда 
		ИДСессии			= Результат.РезультатПроверкиПаспортаПоБазеМВДОнлайн.ИДСессии;
		
		Сообщить(СтрШаблон("Паспорт недействителен: %1
						|Расширенный ответ: %2
						|Описание ошибки: %3"
						, Результат.РезультатПроверкиПаспортаПоБазеМВДОнлайн.ИнфоПаспорт.ПаспортНедействителен
						, Результат.РезультатПроверкиПаспортаПоБазеМВДОнлайн.ИнфоПаспорт.РасширенныйОтвет
						, Результат.РезультатПроверкиПаспортаПоБазеМВДОнлайн.ИнфоПаспорт.ОписаниеОшибки));
	КонецЕсли;
	
	Если ПараметрыПроверки.Свойство("ПолученитьИННОтНалоговой")
		И ПараметрыПроверки.ПолученитьИННОтНалоговой Тогда 
		ИДСессии			= Результат.РезультатПолученныйИННОтНалоговой.ИДСессии;
		
		Сообщить(СтрШаблон("Результат поиска ИНН: %1
							|ИНН: %2", Результат.РезультатПолученныйИННОтНалоговой.ИнфоИНН.РезультатПоиска, Результат.РезультатПолученныйИННОтНалоговой.ИнфоИНН.ИНН));
	КонецЕсли;
	
	Если ПараметрыПроверки.Свойство("ПроверитьПринадлежностьКПДЛ")
		И ПараметрыПроверки.ПроверитьПринадлежностьКПДЛ Тогда
		ИДСессии			= Результат.РезультатПроверкиПринадлежностиКПДЛ.ИДСессии;
		
		Сообщить(СтрШаблон("Это ПДЛ: %1", Результат.РезультатПроверкиПринадлежностиКПДЛ.ИнфоПДЛ.ЭтоПДЛ));
	КонецЕсли;	
	
КонецПроцедуры
